# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть
# *Пример: 5 -> 1 0 1 1 0

from random import randint

number_coins = int(input("Введите количество монет: "))
count_0 = 0
count_1 = 0
for i in range(number_coins):
    random_coins = randint(0,1)
    if random_coins == 0:
        count_0 += 1 
    else:
        count_1 += 1
    print(random_coins)
if count_0 > count_1:
    print("1 - решка; 0 - орел \n" 
        f"надо перевернуть монеты решкой вверх")
elif count_1 > count_0:
    print("1 - решка; 0 - орел \n" 
        f"надо перевернуть монеты орлом вверх")
else:
    print("1 - решка; 0 - орел \n "  
        f"количество орлов и решек одинаковое")
        
        
 