# Задача 30: Заполните массив элементами арифметической прогрессии. Её первый элемент,
# разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

a_1 = int(input("Введите первый элемент прогресси a1 = "))
d = int(input("Разность d = "))
n = int(input("Введите количество элементов: "))

# arithmetic_progression = []

for item in range(1, n+1):
    
    print(f'{item} элемент прогрессии = {a_1 + (item-1) * d}')
