# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Пример:
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

s = int(input("Колличество журавликов = "))
if s % 6 == 0 and s > 0:
    print("Петя = ", s // 6)
    print("Катя = ", s // 3 * 2)
    print("Сережа = ", s // 6)
else:
    print("Колличество журавликов не кратны 6, поэтому ребята не могут сделать целое количество")