# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = int(input("Введите трехзначное число число = "))
while number < 100 or number > 999:
    number = int(input("Введите трехзначное число число = "))
print("Сумма цифр трехзначного числа = ", number//10 % 10 + number % 10 + number//100)
